[
  {
    "doc_id": "jacob_mathew_2005",
    "title": "Jacob Mathew vs State of Punjab (2005)",
    "content": "This landmark case established the comprehensive law on medical negligence in India. \nThe Supreme Court held that a medical professional can only be held liable for negligence if it is established that:\n1. He did not possess the requisite skill which he professed to have\n2. He did not exercise reasonable care in its exercise\n\nThe court laid down specific guidelines for prosecuting medical professionals, including:\n- Private complaints cannot be entertained unless a prima facie case of negligence exists\n- Simple lack of care, error of judgment, or accident is not negligence\n- The doctor must be shown to have acted with gross negligence or recklessness",
    "keywords": [
      "medical negligence",
      "doctor liability",
      "malpractice",
      "prosecution"
    ],
    "statutes": [
      "IPC 304A",
      "BNS 106"
    ],
    "year": 2005,
    "court": "Supreme Court of India",
    "source": "sample"
  },
  {
    "doc_id": "kesavananda_bharati_1973",
    "title": "Kesavananda Bharati vs State of Kerala (1973)",
    "content": "The most important constitutional law case in India. The Supreme Court established the Basic Structure Doctrine.\nKey holdings: Parliament has the power to amend any part of the Constitution, but cannot amend the basic structure.\nBasic structure includes: fundamental rights, secularism, federalism, separation of powers, judicial review, democracy.",
    "keywords": [
      "basic structure",
      "constitution",
      "amendment",
      "parliament power"
    ],
    "statutes": [
      "Article 368",
      "Article 13"
    ],
    "year": 1973,
    "court": "Supreme Court of India",
    "source": "sample"
  },
  {
    "doc_id": "navtej_johar_2018",
    "title": "Navtej Singh Johar vs Union of India (2018)",
    "content": "The Supreme Court decriminalized homosexuality by reading down Section 377 of the Indian Penal Code.\nKey holdings: Consensual sexual conduct between adults of the same sex in private is not a crime.\nSection 377 is unconstitutional to the extent it criminalizes consensual homosexual acts.\nThe right to sexual orientation and gender identity is protected under Article 21.",
    "keywords": [
      "section 377",
      "homosexuality",
      "LGBTQ",
      "decriminalization",
      "privacy"
    ],
    "statutes": [
      "IPC 377",
      "Article 14",
      "Article 21"
    ],
    "year": 2018,
    "court": "Supreme Court of India",
    "source": "sample"
  },
  {
    "doc_id": "puttaswamy_2017",
    "title": "K.S. Puttaswamy vs Union of India (2017)",
    "content": "The landmark Right to Privacy judgment. A nine-judge Constitution Bench unanimously held that right to privacy is a fundamental right.\nPrivacy is intrinsic to Article 21 (right to life and personal liberty).\nPrivacy includes: bodily autonomy, personal identity, informational privacy, decisional privacy.\nThis judgment is foundational for data protection law in India.",
    "keywords": [
      "privacy",
      "fundamental right",
      "article 21",
      "data protection"
    ],
    "statutes": [
      "Article 21",
      "Article 14",
      "Article 19"
    ],
    "year": 2017,
    "court": "Supreme Court of India",
    "source": "sample"
  },
  {
    "doc_id": "vishaka_1997",
    "title": "Vishaka vs State of Rajasthan (1997)",
    "content": "Landmark case that laid down guidelines for prevention of sexual harassment at workplace.\nSexual harassment at workplace violates fundamental rights under Articles 14, 19(1)(g), and 21.\nThe court laid down binding guidelines known as 'Vishaka Guidelines'.\nThese guidelines have the force of law until proper legislation is enacted.",
    "keywords": [
      "sexual harassment",
      "workplace",
      "vishaka guidelines",
      "women's rights"
    ],
    "statutes": [
      "Article 14",
      "Article 19",
      "Article 21",
      "POSH Act 2013"
    ],
    "year": 1997,
    "court": "Supreme Court of India",
    "source": "sample"
  }
]