[
  {
    "doc_id": "jacob_mathew_2005",
    "title": "Jacob Mathew vs State of Punjab (2005)",
    "content": "This landmark case established the comprehensive law on medical negligence in India. \nThe Supreme Court held that a medical professional can only be held liable for negligence if it is established that:\n1. He did not possess the requisite skill which he professed to have\n2. He did not exercise reasonable care in its exercise\n\nThe court laid down specific guidelines for prosecuting medical professionals, including:\n- Private complaints cannot be entertained unless a prima facie case of negligence exists\n- Simple lack of care, error of judgment, or accident is not negligence\n- The doctor must be shown to have acted with gross negligence or recklessness\n\nThis case is fundamental for understanding medical malpractice law in India.",
    "keywords": [
      "medical negligence",
      "doctor liability",
      "malpractice",
      "prosecution",
      "supreme court"
    ],
    "statutes": [
      "IPC 304A",
      "BNS 106"
    ],
    "year": 2005,
    "court": "Supreme Court of India"
  },
  {
    "doc_id": "kesavananda_bharati_1973",
    "title": "Kesavananda Bharati vs State of Kerala (1973)",
    "content": "The most important constitutional law case in India. The Supreme Court established the Basic Structure Doctrine.\n\nKey holdings:\n1. Parliament has the power to amend any part of the Constitution\n2. However, Parliament cannot amend the basic structure or framework of the Constitution\n3. Basic structure includes: fundamental rights, secularism, federalism, separation of powers, judicial review, democracy\n\nThe 13-judge bench decision (7-6 majority) is a cornerstone of Indian constitutional jurisprudence. It limits parliamentary power and protects essential constitutional values.\n\nThis doctrine has been applied to strike down several constitutional amendments that attempted to curtail judicial review or fundamental rights.",
    "keywords": [
      "basic structure",
      "constitution",
      "amendment",
      "parliament power",
      "fundamental rights",
      "constitutional law"
    ],
    "statutes": [
      "Article 368",
      "Article 13"
    ],
    "year": 1973,
    "court": "Supreme Court of India"
  },
  {
    "doc_id": "navtej_johar_2018",
    "title": "Navtej Singh Johar vs Union of India (2018)",
    "content": "The Supreme Court decriminalized homosexuality by reading down Section 377 of the Indian Penal Code.\n\nKey holdings:\n1. Consensual sexual conduct between adults of the same sex in private is not a crime\n2. Section 377 is unconstitutional to the extent it criminalizes consensual homosexual acts\n3. The right to sexual orientation and gender identity is protected under Article 21 (right to life and dignity)\n4. LGBTQ+ individuals have equal rights to privacy and dignity\n\nThis historic judgment overruled Suresh Kumar Koushal (2013) and upheld:\n- Right to equality (Article 14)\n- Freedom of expression (Article 19)\n- Right to privacy and dignity (Article 21)\n\nThe court emphasized that constitutional morality must prevail over social morality.",
    "keywords": [
      "section 377",
      "homosexuality",
      "LGBTQ",
      "decriminalization",
      "privacy",
      "dignity",
      "equality"
    ],
    "statutes": [
      "IPC 377",
      "Article 14",
      "Article 21"
    ],
    "year": 2018,
    "court": "Supreme Court of India"
  },
  {
    "doc_id": "puttaswamy_2017",
    "title": "K.S. Puttaswamy vs Union of India (2017)",
    "content": "The landmark Right to Privacy judgment. A nine-judge Constitution Bench unanimously held that right to privacy is a fundamental right.\n\nKey holdings:\n1. Right to privacy is intrinsic to Article 21 (right to life and personal liberty)\n2. Privacy includes: bodily autonomy, personal identity, informational privacy, decisional privacy\n3. Privacy is not absolute and can be restricted under a three-fold test:\n   - Legitimate state aim\n   - Law that is fair, just, and reasonable\n   - Proportionality\n\nImplications:\n- Right to control personal data\n- Protection against surveillance\n- Sexual orientation is a matter of privacy\n- Overruled MP Sharma (1954) and Kharak Singh (1962)\n\nThis judgment is foundational for data protection law in India.",
    "keywords": [
      "privacy",
      "fundamental right",
      "article 21",
      "aadhaar",
      "data protection",
      "surveillance",
      "autonomy"
    ],
    "statutes": [
      "Article 21",
      "Article 14",
      "Article 19"
    ],
    "year": 2017,
    "court": "Supreme Court of India"
  },
  {
    "doc_id": "vineeta_sharma_2020",
    "title": "Vineeta Sharma vs Rakesh Sharma (2020)",
    "content": "This case clarified the Hindu Succession (Amendment) Act, 2005 regarding daughters' coparcenary rights.\n\nKey holdings:\n1. Daughters have equal coparcenary rights by birth\n2. This right exists irrespective of whether the father was alive on the date of the 2005 amendment\n3. The right is by birth, not by the date of the amendment coming into force\n4. Daughters have the same rights as sons in ancestral property\n\nThis ensures gender equality in inheritance of Hindu Undivided Family (HUF) ancestral property.\n\nThe court overruled the contrary view in Prakash vs Phulavati (2015) and Danamma vs Amar (2018).",
    "keywords": [
      "hindu succession",
      "coparcenary",
      "daughter rights",
      "inheritance",
      "property",
      "gender equality",
      "ancestral property"
    ],
    "statutes": [
      "Hindu Succession Act 1956",
      "Hindu Succession Amendment Act 2005"
    ],
    "year": 2020,
    "court": "Supreme Court of India"
  },
  {
    "doc_id": "maneka_gandhi_1978",
    "title": "Maneka Gandhi vs Union of India (1978)",
    "content": "This case expanded the scope of Article 21 (right to life and personal liberty).\n\nKey holdings:\n1. Right to live is not merely physical existence but the right to live with human dignity\n2. Procedure established by law must be fair, just, and reasonable\n3. Articles 14, 19, and 21 are interconnected - any law affecting personal liberty must satisfy all three\n4. 'Procedure established by law' was harmonized with 'due process of law'\n\nThis case revolutionized constitutional interpretation in India by:\n- Expanding fundamental rights beyond literal interpretation\n- Establishing that arbitrariness violates Article 14\n- Creating the foundation for public interest litigation\n\nMany subsequent rights (education, health, livelihood, shelter) were derived from this expansive reading of Article 21.",
    "keywords": [
      "article 21",
      "right to life",
      "personal liberty",
      "due process",
      "fundamental rights",
      "dignity",
      "fair procedure"
    ],
    "statutes": [
      "Article 21",
      "Article 14",
      "Article 19"
    ],
    "year": 1978,
    "court": "Supreme Court of India"
  },
  {
    "doc_id": "vishaka_1997",
    "title": "Vishaka vs State of Rajasthan (1997)",
    "content": "Landmark case that laid down guidelines for prevention of sexual harassment at workplace.\n\nKey holdings:\n1. Sexual harassment at workplace violates fundamental rights under Articles 14, 19(1)(g), and 21\n2. In absence of legislation, the court laid down binding guidelines known as 'Vishaka Guidelines'\n3. These guidelines have the force of law until proper legislation is enacted\n4. Employers must establish complaint committees and follow prescribed procedures\n\nThe guidelines were later codified as the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013.\n\nThis case is significant for:\n- Judicial activism in protecting women's rights\n- Recognition of international conventions (CEDAW) in Indian law\n- Filling legislative vacuum through guidelines",
    "keywords": [
      "sexual harassment",
      "workplace",
      "vishaka guidelines",
      "women's rights",
      "gender discrimination",
      "POSH Act"
    ],
    "statutes": [
      "Article 14",
      "Article 19",
      "Article 21",
      "POSH Act 2013"
    ],
    "year": 1997,
    "court": "Supreme Court of India"
  }
]